_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 43659, 441)        0         
_________________________________________________________________
simple_rnn_1 (SimpleRNN)     (None, 43659, 75)         38775     
_________________________________________________________________
time_distributed_1 (TimeDist (None, 43659, 1)          76        
_________________________________________________________________
dense_2 (Dense)              (None, 43659, 75)         150       
_________________________________________________________________
dense_3 (Dense)              (None, 43659, 75)         5700      
_________________________________________________________________
dense_4 (Dense)              (None, 43659, 1)          76        
=================================================================
Total params: 44,777
Trainable params: 44,777
Non-trainable params: 0
_________________________________________________________________
