_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 1, 441)            0         
_________________________________________________________________
simple_rnn_2 (SimpleRNN)     (None, 1, 75)             38775     
_________________________________________________________________
time_distributed_2 (TimeDist (None, 1, 1)              76        
_________________________________________________________________
dense_6 (Dense)              (None, 1, 75)             150       
_________________________________________________________________
dense_7 (Dense)              (None, 1, 75)             5700      
_________________________________________________________________
dense_8 (Dense)              (None, 1, 1)              76        
=================================================================
Total params: 44,777
Trainable params: 44,777
Non-trainable params: 0
_________________________________________________________________
