_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 441)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 441)               0         
_________________________________________________________________
gaussian_noise_1 (GaussianNo (None, 441)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 75)                33150     
_________________________________________________________________
dense_2 (Dense)              (None, 75)                5700      
_________________________________________________________________
dense_3 (Dense)              (None, 75)                5700      
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 76        
=================================================================
Total params: 44,626
Trainable params: 44,626
Non-trainable params: 0
_________________________________________________________________
