_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, None, 4410)        0         
_________________________________________________________________
gru_1 (GRU)                  (None, None, 200)         2766600   
_________________________________________________________________
time_distributed_1 (TimeDist (None, None, 200)         40200     
_________________________________________________________________
time_distributed_2 (TimeDist (None, None, 4410)        886410    
=================================================================
Total params: 3,693,210
Trainable params: 3,693,210
Non-trainable params: 0
_________________________________________________________________
